@pytest.mark.skip(reason="Template")
def test_58649_1(app, credo_db):
    """
    {#
        :id:                58649_1
        :priority:          Средний
        :module:            Ядро
        :description:       Новый параметр Продукта\варианта "Показывать заявку в интернет банкинге" = "Да"
        :precondition:      Пользователь авторизован
        :source_point:      58649
        :comment:
        :tc_type:           +
        :db_env:            База FORPOST: forp_d3; Тестовая дата: 09.12.2021
        :client_env:        Google Chrome 110 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Mozilla Firefox 107 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Microsoft EDGE 108 [Windows 10]
    }#
        :param: app: фикстура приложения
        :param: db_credo: фикстура базы данных
    """

    value = ''
    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)


    PRODUCT = ''

    VARIANT = ''


    # :newpage: #######################################################################################################

    # :step: Переходим в список продуктов

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CLIENTNEWCARDINNER"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "new_card_v2"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "new_card_virt"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "reissue_maincard"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "reissue_salarycard",

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "reissue_creditcard"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "reissue_virtual"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "add_card"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "add_virt"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CREDITCARDSALES"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "OnCredit"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "salary_ib"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "cart_pokup_ib"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "pre_accepted_credit"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров продукта "NewLoanInner"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "INSURANCE"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "RequestInsurance%"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров продукта "Information"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "DBOTRANSFERS"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "InBankTransfer"
    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "DEPOSITSSDBO"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "OpenDepositDBO"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров продукта "DebetTransaction"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "DEPOSITS"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "PartWithdrawDeposit"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров продукта "BankCancelCardCheck"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров продукта "TerminalEquipment"

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CHANGING_CUSTOMER"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта "change_front"
    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Да"


    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)

@pytest.mark.skip(reason="Template")
def test_58649_2(app, credo_db):
    """
    {#
        :id:                58649_2
        :priority:          Средний
        :module:            Ядро
        :description:       Новый параметр Продукта\варианта "Показывать заявку в интернет банкинге" = "Нет"
        :precondition:      Пользователь авторизован
        :source_point:      58649
        :comment:
        :tc_type:           +
        :db_env:            База FORPOST: forp_d3; Тестовая дата: 09.12.2021
        :client_env:        Google Chrome 110 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Mozilla Firefox 107 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Microsoft EDGE 108 [Windows 10]
    }#
        :param: app: фикстура приложения
        :param: db_credo: фикстура базы данных
    """

    value = ''
    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)


    PRODUCT = ''

    VARIANT = ''


    # :newpage: #######################################################################################################

    # :step: Переходим в список продуктов

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CREDITCARDSALES"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров варианта (кроме вариантов ДБО)

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CreditCardSalesAuto"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "Deposits"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CreditCardSalesAgent"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "changing_customer"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта (кроме вариантов ДБО)

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "Insurance"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта (кроме вариантов ДБО)

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "ArchiveFilesOfClients"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "CreditSmallBusiness"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "EFR"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "AdvanceRequest"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "Pension"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "Transfers"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "Factoring"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Переходим в список вариантов продукта "BasicAccounts"

    # :newpage: #######################################################################################################

    # :step: Переходим в список параметров любого варианта

    # :newpage: #######################################################################################################

    # :assert: В списке параметров присутствует параметр showRequestInDBO с предзаполненым значением "Нет"
    # :step: Нажимаем кнопку "Завершить"


    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)

@pytest.mark.skip(reason="Template")
def test_58649_3(app, credo_db):
    """
    {#
        :id:                58649_3
        :priority:          Средний
        :module:            Ядро
        :description:       Проверка отображения заявок в МП
        :precondition:      У клиента существует заявка "SWIFT-перевод без открытия счета"
        :precondition:      У клиента существует заявка "Оформление заявления о перечислении пенсии (пособия)"
        :precondition:      У клиента существует заявка "Заявка на Online-страхование"
        :precondition:      У клиента существует заявка "ON-кредит за 5 минут"
        :precondition:      На варианте SwiftTransfer параметр showRequestInDBO = "Нет"
        :precondition:      На варианте pensionApplicationRequest параметр showRequestInDBO = "Нет"
        :precondition:      На варианте OnCredit параметр showRequestInDBO = "Да"
        :precondition:      На варианте RequestInsurance9 параметр showRequestInDBO = "Да"
        :precondition:      Клиент авторизован и идентифицирован в МП
        :source_point:      58649
        :comment:
        :tc_type:           +
        :db_env:            База: forp_d3; Тестовая дата: 09.12.2021
        :client_env:        Android 9.0, iOS 16.1
    }#
        :param: app: фикстура приложения
        :param: db_credo: фикстура базы данных
    """

    value = ''
    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)


    PRODUCT = ''

    VARIANT = ''


    # :newpage: #######################################################################################################

    # :step: Переходим на вкладку заявки

    # :newpage: #######################################################################################################

    # :assert: В списке заявок отображаются заявки "Заявка на Online-страхование" и "ON-кредит за 5 минут"
    # :assert: В списке заявок не отображаются заявки "SWIFT-перевод без открытия счета" и "Оформление заявления о перечислении пенсии (пособия)"


    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)

@pytest.mark.skip(reason="Template")
def test_58649_4(app, credo_db):
    """
    {#
        :id:                58649_4
        :priority:          Средний
        :module:            Ядро
        :description:       Проверка отображения заявок в ИБ
        :precondition:      У клиента существует заявка "SWIFT-перевод без открытия счета"
        :precondition:      У клиента существует заявка "Оформление заявления о перечислении пенсии (пособия)"
        :precondition:      У клиента существует заявка "Заявка на Online-страхование"
        :precondition:      У клиента существует заявка "ON-кредит за 5 минут"
        :precondition:      На варианте SwiftTransfer параметр showRequestInDBO = "Да"
        :precondition:      На варианте pensionApplicationRequest параметр showRequestInDBO = "Да"
        :precondition:      На варианте OnCredit параметр showRequestInDBO = "Нет"
        :precondition:      На варианте RequestInsurance9 параметр showRequestInDBO = "Нет"
        :precondition:      Клиент авторизован и идентифицирован в ДБО
        :source_point:      58649
        :comment:
        :tc_type:           +
        :db_env:            База: forp_d3; Тестовая дата: 09.12.2021
        :client_env:        Google Chrome 110 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Mozilla Firefox 107 [Windows 10; openSuSE Linux Leap 15.1]
        :client_env:        Microsoft EDGE 108 [Windows 10]
    }#
        :param: app: фикстура приложения
        :param: db_credo: фикстура базы данных
    """

    value = ''
    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)


    PRODUCT = ''

    VARIANT = ''


    # :newpage: #######################################################################################################

    # :step: Переходим на вкладку заявки

    # :newpage: #######################################################################################################

    # :assert: В списке заявок отображаются заявки "SWIFT-перевод без открытия счета" и "Оформление заявления о перечислении пенсии (пособия)"
    # :assert: В списке заявок не отображаются заявки "Заявка на Online-страхование" и "ON-кредит за 5 минут"


    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)























































































































