pytest.mark.skip(reason="Template")
def test_57080_1(app, db_credo):
    """
    {#
        :id:                57080_1
        :priority:          Средний
        :module:            Ядро
        :description:       Проверка истории изменений в справочнике органов, выдавших ДУЛ
        :precondition:      Пользователь levdanskij авторизирован, параметр useNewCabinet = "да"
        :precondition:      В базе содержится "Справочник органов, выдавших ДУЛ"
        :tc_type:           +
        :client_env:        Google Chrome 96 [Windows 10; openSuSE Linux Leap 15.3]
        :client_env:        Mozilla Firefox 94 [Windows 10; openSuSE Linux Leap 15.3]
        :client_env:        Microsoft EDGE 96 [Windows 10]
        :precondition_time: 10
        :time_of_test:      20
        :count_of_check:    6
    }#
        :param: app: фикстура приложения
        :param: credo_db: фикстура базы данных
    """

    value = ''
    logrecord = "{time} [{module}] -- [{method}]".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(__file__)), method=(sys._getframe().f_code.co_name))
    print(logrecord)

    PRODUCT = ''
    VARIANT = ''

    # :newpage: #######################################################################################################

    # :step: Переходим в "Список строк справочника" справочника органов, выдавших ДУЛ
    # :step: Нажимаем кнопку "Создать"

    # :newpage: #######################################################################################################

    # :step: Заполняем Наименование строки справочника
    value = 'УУУ'
    # :step: Заполняем Приоритет
    value = '1'
    # :step: Заполняем Код органа
    value = '777777'
    # :step: Заполняем Сокр. наименование
    value = 'У'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Добавление" и исполнителем "levdanskij"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем на наименование строки справочника
    value = 'УУУ'

    # :newpage: #######################################################################################################

    # :step: Изменяем Сокр. наименование
    value = 'УУ'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Изменение" и исполнителем "levdanskij"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем на наименование строки справочника
    value = 'УУУ'

    # :newpage: #######################################################################################################

    # :step: Изменяем наименование строки справочника
    value = 'УУУХ'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУХ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Изменение" и исполнителем "levdanskij"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем на наименование строки справочника
    value = 'УУУХ'

    # :newpage: #######################################################################################################

    # :step: Изменяем приоритет
    value = '2'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУХ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Изменение" и исполнителем "levdanskij"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем на наименование строки справочника
    value = 'УУУХ'

    # :newpage: #######################################################################################################

    # :step: Изменяем код органа
    value = '666666'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУХ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Изменение" и исполнителем "levdanskij"
    # :step: Нажимаем кнопку "Завершить"

    # :newpage: #######################################################################################################

    # :step: Нажимаем на наименование строки справочника
    value = 'УУУХ'

    # :newpage: #######################################################################################################

    # :step: Изменяем приоритет
    value = '2'
    # :step: Заполняем Обоснование изменения
    value = '1'
    # :step: Нажимаем кнопку "Сохранить"

    # :newpage: #######################################################################################################

    # :step: Перереходим в историю изменений справочника "УУУХ"
    # :assert: В истории изменений строки справочника добавилась новая запись с комментарием "Изменение" и исполнителем "levdanskij"


    logrecord = "{time} [{module}] -- [{method}] Test success!!!".format(time=datetime.now().strftime("%H:%M:%S,%f"), module=(os.path.basename(file)), method=(sys._getframe().f_code.co_name))
    print(logrecord)
